#include "Header.h"

void questions()
{
	string question1 = "Цели и задачи технологий разработки ПО";
	string question1_var_A = "Постановка задачи,выбор метода,разработка алгоритма,написание программы, ввод программы, трансляция, компоновка, выполнение, тестирование, отладка, документирование, эксплуатация, модификация, снятие с эксплуатациии";
	string question1_var_B = "Постановка задачи,написание программы , снятие с эксплуатации";
	string question1_var_C = "Постановка задачи,ввод программы,отладка,эксплуатация , снятие с эксплуатации";
	string questin1_var_D = "Ввод программы , трансляция,документирование,модификация";
	char question1_correct_option = 'A';

	string question2 = "Что такое программа?";
	string question2_var_A = "A:Это объект разработки, который не является осязаемым (нельзя пощупать, взвесить и т. п.), доступен пониманию ЭВМ(электронно-вычислительная машина), для которой написан.";
	string question2_var_B = "B:Это большое количество цветного тескта на экране";
	string guestion2_var_C = "C:Это объект разработки,за котрый программист получает огромное количество денег";
	string question2_var_D = "D:Всё вышеперечисленное";
	char question2_correct_option = 'A';
	string question3[6] = { "Каким ПО бывает по классификации?",
	"А:Системное ПО, Прикладное ПО,Инструментальное ПО",
	"В:Системное ПО,Вычислительное ПО,ПРограммное ПО",
	"C:Программное ПО,Операционное ПО,Программируемое ПО",
	"D:Системное ПО, Обеспечиваемое ПО,Прикладное ПО",
	"A" };
	string question4[6] = { "Что такое язык программирования?",
	"A:Формальный язык, предназначенный для записи компьютерных программ.",
	"B:Формальный язык для построения приложений и сайтов",
	"C:Набор специфических правил,используемых для генерации кода",
	"D:Набор специфических правил,используемых для генерации кода",
	"A" };
	string question5[6] = { "Что такое стандарт оформления кода?",
	"A:Набор правил,используемый для написания синтаксически правильного текста",
	"B:Набор правил и солгашений,используемых при написании исходного кода на некотором языке программирования",
	"C:Набор специфических правил,используемых для генерации кода",
	"D:Набор специфических правил,используемых для генерации кода",
	"B" };
	string question6[6] = { "Что такое Юникод?",
	"A:Язык программирования",
	"B:Код на языке программирования",
	"C:Стандарт кодирования символов",
	"D:Набор непонятных букв",
	"C" };
	string question7[6] = { "Каковы главные свойства алгоритмов?",
	"A:Дискретность,понятность,определённость,конечность,массовость,эффективность",
	"B:Ясность,точность,логичность,читаемость",
	"C:Костыльность,комплексность,приятность,конкретность",
	"D:Приветливость,краткость,массовость,важность",
	"A" };
	string question8[6] = { "Что такое парадигма программирования?",
	"A:Совокупность идей по написанию кода",
	"B:Совокупность идей для программирования",
	"C:Совокупность идей , собранных для облегчения написания кода",
	"D:Совокупность идей и понятий ,определяющих стиль написания компютерных программ",
	"D" };
	string question9[6] = { "Что такое отладка?",
	"A:Процесс проверки кода на ошибки",
	"B:Процесс запуска и выполнения программы в режиме отладки",
	"C:Процесс запуска и просматривания кода",
	"D:Процесс применения изменений к скомпилированному коду",
	"B" };

}
